/* ============================================================================================================================= *//**
 * @file       stm32f0xx.h
 * @author     Krzysztof Pierczyk (krzysztof.pierczyk@gmail.com)
 * @maintainer Krzysztof Pierczyk (krzysztof.pierczyk@gmail.com)
 * @date       Thursday, 15th July 2021 10:14:58 am
 * @modified   Thursday, 15th July 2021 10:36:56 am
 * @project    stm-utils
 * @brief      Definitions of interrupt vectors for STMF0xx devices
 *    
 * @copyright Krzysztof Pierczyk © 2022
 * /// ============================================================================================================================ */

#ifndef __STM_UTILS_DEVICE_INTERRUPTS_STMF0xx_H__
#define __STM_UTILS_DEVICE_INTERRUPTS_STMF0xx_H__

/* =========================================================== Includes =========================================================== */

#include "interrupts/definitions.h"

/* ========================================================== C mangling ========================================================== */

#ifdef __cplusplus
extern "C" {
#endif

/* ========================================================== Definitions ========================================================= */



/* ================================================================================================================================ */

#ifdef __cplusplus
}
#endif

/* ================================================================================================================================ */

#endif
